# ---------- 模块 ---------
# -- Python模块（module）：一个.py文件就是一个模块，模块是Python程序的基本组成单位，可以包含变量、函数、类以及可执行代码。
# -- 模块名与文件名相同，不同模块中的变量、函数、类互不冲突。
# -- 模块可以包含可执行代码，这些代码在第一次导入时执行，而之后再次导入时不会再次执行。
# -- 模块有两种类型：内置模块和自定义模块。内置模块是Python自带的模块，可以直接使用；自定义模块是用户自己编写的模块，需要先创建.py文件，然后在其他.py文件中导入使用，模块名就是文件名。
# -- 通常我们将导入的模块放在.py文件的开头，遵循PEP8规范，导入顺序为：标准库模块、第三方模块、自定义模块。
# -- python的模块是不需要导出声明的。
# -- 导入模块的方式：
# 1. import 模块名：导入整个模块，使用模块中的变量、函数、类时需要使用模块名作为前缀。多个模块可以使用逗号分隔导入，也可以使用多行import语句导入。
# 2. import 模块名 as 别名：导入整个模块，并为模块指定一个别名，使用模块中的变量、函数、类时需要使用别名作为前缀。
# 3. from 模块名 import 变量名/函数名/类名：从模块中导入指定的变量、函数或类，使用时不需要模块名作为前缀。也可以使用逗号分隔导入多个变量、函数或类，也可以使用多行from import语句导入。
# 4. from 模块名 import 变量名/函数名/类名 as 别名：从模块中导入指定的变量、函数或类，并为其指定一个别名，使用时不需要模块名作为前缀，但需要使用别名。
# 5. from 模块名 import *：从模块中导入所有的变量、函数和类，使用时不需要模块名作为前缀，但不推荐使用这种方式，因为可能会引起命名冲突。
# -- 模块的搜索路径：Python解释器在导入模块时，会按照以下顺序搜索模块：
# 1. 当前目录
# 2. 环境变量PYTHONPATH指定的目录
# 3. Python安装目录下的Lib目录
# 导入模块示例：
# import random   # 导入整个random内置模块
# print(random.randint(1, 100))   # 调用random模块中的randint函数，生成1到100之间的随机整数
# from random import randint   # 从random模块中导入randint函数
# print(randint(1, 100))   # 直接调用randint函数，生成1到100之间的随机整数

# ---------- __name__内置变量 ---------
# -- __name__是Python中的一个内置变量，用于表示当前模块的名称
# -- 当模块被直接运行时，__name__的值为"__main__"，当模块被导入时，__name__的值为模块的名称。
# -- 通过判断__name__的值，可以控制模块中的代码在直接运行时执行，而在被导入时不执行，从而实现模块的复用。
# -- 使用场景：这种方式通常用于在模块中编写测试代码或示例代码，避免在导入模块时执行
# 例如：
# if __name__ == "__main__":
#     print("模块被直接运行")
# else:
#     print("模块被导入")

# ---------- __all__内置变量 ---------
# -- __all__是Python中的一个内置变量，用于定义模块的公共接口，指定哪些变量、函数和类可以被导入，一般写在模块的开头。
# -- 当使用from 模块名 import * 导入时，只会导入模块中__all__变量中指定的变量、函数和类。
# -- 如果__all__不定义，则from 模块名 import * 会导入模块中的所有变量、函数和类。
# 例如：
# __all__ = ["PI", "greet", "jc"]   # 定义模块的公共接口，只允许导入PI常量、greet函数和jc函数

# --------- 包（package） ---------
# -- 包（package）是Python中用于组织模块的另一种方式，它是一个包含多个模块的目录，目录下必须有一个__init__.py文件。
# -- __init__.py文件用于初始化包，可以包含包的初始化代码，也可以定义包的公共接口。
# -- 作用：包的作用是当模块文件较多时，将相关的模块组织在一起，形成一个命名空间，避免模块名冲突，提高代码的可维护性和可读性。
# -- 导入包中模块或功能的方式：
# 1. import 包名：导入整个包，使用包中的模块时需要使用包名作为前缀。
# 2. import 包名.模块名：导入包中的模块，使用时需要使用包名和模块名作为前缀。
# 3. from 包名 import 模块名：从包中导入指定的模块，使用时不需要包名作为前缀。
# 4. from 包名.模块名 import 变量名/函数名/类名：从包中的模块中导入指定的变量、函数或类，使用时不需要包名和模块名作为前缀。
# 5. from 包名 import *：从包中导入所有的模块，使用时不需要包名作为前缀，但不推荐使用这种方式，因为可能会引起命名冲突。
#       注：这种导入方式需要在包的__init__.py文件中定义__all__变量，指定允许导入的模块，否则会报错。
# 6. from 包名.模块名 import *：从包中的模块中导入所有的变量、函数和类，使用时不需要包名和模块名作为前缀，但不推荐使用这种方式，因为可能会引起命名冲突。
